In [ ]:
# Adam Haizriq - Data Cleaning Assignment

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [2]:
data_link = 'https://raw.githubusercontent.com/realpython/python-data-cleaning/refs/heads/master/Datasets/BL-Flickr-Images-Book.csv'
data = pd.read_csv(data_link)
data.head(10)

,Identifier,Edition Statement,Place of Publication,Date of Publication,Publisher,Title,Author,Contributors,Corporate Author,Corporate Contributors,Former owner,Engraver,Issuance type,Flickr URL,Shelfmarks
0,206,NaN,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,"FORBES, Walter.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12641.b.30.
1,216,NaN,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12626.cc.2.
2,218,NaN,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12625.dd.1.
3,472,NaN,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.","Appleyard, Ernest Silvanus.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 10369.bbb.15.
4,480,"A new edition, revised, etc.",London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.","BROOME, John Henry.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 9007.d.28.
5,481,"Fourth edition, revised, etc.",London,1875,William Macintosh,"[The World in which I live, and my place in it...","A., E. S.","BROOME, John Henry.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 9006.ee.10.
6,519,NaN,London,1872,The Author,Lagonells. By the author of Darmayne (F. E. A....,"A., F. E.","ASHLEY, Florence Emily.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12637.e.3.
7,667,NaN,"pp. 40. G. Bryan & Co: Oxford, 1898",NaN,NaN,"The Coming of Spring, and other poems. By J. A...","A., J.|A., J.","ANDREWS, J. - Writer of Verse",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 011652.g.73.
8,874,NaN,London],1676,NaN,"A Warning to the inhabitants of England, and L...",Remaʿ.,"ADAMS, Mary.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 11645.bb.42.
9,1143,NaN,London,1679,NaN,A Satyr against Vertue. (A poem: supposed to b...,"A., T.","OLDHAM, John.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 11602.ee.10.(2.)

In [3]:
# Dropping columns that wont be usefull

to_drop = ['Edition Statement',
           'Corporate Author',
           'Corporate Contributors',
           'Former owner',
           'Engraver',
           'Contributors',
           'Issuance type',
           'Shelfmarks']

data.drop(to_drop, inplace=True, axis=1)

In [4]:
data.head(10)

,Identifier,Place of Publication,Date of Publication,Publisher,Title,Author,Flickr URL
0,206,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,http://www.flickr.com/photos/britishlibrary/ta...
1,216,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
2,218,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
3,472,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
4,480,London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
5,481,London,1875,William Macintosh,"[The World in which I live, and my place in it...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
6,519,London,1872,The Author,Lagonells. By the author of Darmayne (F. E. A....,"A., F. E.",http://www.flickr.com/photos/britishlibrary/ta...
7,667,"pp. 40. G. Bryan & Co: Oxford, 1898",NaN,NaN,"The Coming of Spring, and other poems. By J. A...","A., J.|A., J.",http://www.flickr.com/photos/britishlibrary/ta...
8,874,London],1676,NaN,"A Warning to the inhabitants of England, and L...",Remaʿ.,http://www.flickr.com/photos/britishlibrary/ta...
9,1143,London,1679,NaN,A Satyr against Vertue. (A poem: supposed to b...,"A., T.",http://www.flickr.com/photos/britishlibrary/ta...

In [5]:
# checking whether data in the colum is unique to be set as index
data['Identifier'].is_unique

True

In [6]:
# replace existing index
data = data.set_index('Identifier')
data.head()

,Place of Publication,Date of Publication,Publisher,Title,Author,Flickr URL
Identifier,,,,,,
206,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,http://www.flickr.com/photos/britishlibrary/ta...
216,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
218,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
472,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
480,London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...

In [7]:
# accessing record with loc[], can refer to the value of the Identifier
data.loc[218]

Place of Publication                                               London
Date of Publication                                                  1869
Publisher                                           Bradbury, Evans & Co.
Title                   Love the Avenger. By the author of “All for Gr...
Author                                                          A., A. A.
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Name: 218, dtype: object

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8287 entries, 206 to 4160339
Data columns (total 6 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Place of Publication  8287 non-null   object
 1   Date of Publication   8106 non-null   object
 2   Publisher             4092 non-null   object
 3   Title                 8287 non-null   object
 4   Author                6509 non-null   object
 5   Flickr URL            8287 non-null   object
dtypes: object(6)
memory usage: 711.2+ KB

In [9]:
# column that is possible to change from object to numeric
# Date of Publication

# look for date that has more that 4 digit
data[data['Date of Publication'].str.len() > 4]['Date of Publication'].head(20)

Identifier
206             1879 [1878]
1929            1839, 38-54
2956                1860-63
5382     1847, 48 [1846-48]
5385                [1897?]
5389                [1897?]
11361              [1894-96
13364                [1885]
14466               [1860?]
17752                [1833]
21782               [1817.]
24878          1886, [1885]
27797                [1834]
28615               1852-63
28758              1866, 76
34785     [1860,] 1861-1863
34793                [1872]
34852               [1874.]
34914        1858 [1851-58]
34987           1857 [1856]
Name: Date of Publication, dtype: object

In [10]:
# Remove the extra dates in square brackets, wherever present: 1879 [1878]
# Convert date ranges to their “start date”, wherever present: 1860-63; 1839, 38-54
# Completely remove the dates we are not certain about and replace them with NumPy’s NaN: [1897?]
# Convert the string nan to NumPy’s NaN value

# extract the correct date with regex
extr = data['Date of Publication'].str.extract(r'^(\d{4})', expand=False)
extr.head()

Identifier
206    1879
216    1868
218    1869
472    1851
480    1857
Name: Date of Publication, dtype: object

In [11]:
# convert the column to from object numerical
data['Date of Publication'] = pd.to_numeric(extr)
data['Date of Publication'].dtype

dtype('float64')

In [12]:
data.loc[data['Date of Publication'].isnull(), 'Date of Publication']

Identifier
667       NaN
5385      NaN
5389      NaN
11361     NaN
11852     NaN
           ..
4113816   NaN
4114334   NaN
4114889   NaN
4115138   NaN
4159563   NaN
Name: Date of Publication, Length: 971, dtype: float64

In [13]:
# Percentage of missing data
perc_missing = data['Date of Publication'].isnull().sum()/len(data)*100
print(perc_missing)

11.717147339205985

In [14]:
# Replacing data names.

pub = data['Place of Publication']
london = pub.str.contains('London')
oxford = pub.str.contains('Oxford')
plymouth = pub.str.contains('Plymouth')

data['Place of Publication'] = np.where(london, 'London',
                                        np.where(oxford, 'Oxford',
                                                 np.where(plymouth, 'Plymouth',
                                                          pub.str.replace('-', ' '))))

In [15]:
data['Place of Publication'].head(10)

Identifier
206     London
216     London
218     London
472     London
480     London
481     London
519     London
667     Oxford
874     London
1143    London
Name: Place of Publication, dtype: object

In [16]:
#Changing Column Type.

print(data['Place of Publication'].dtypes)
data['Place of Publication'] = data['Place of Publication'].astype('category')
print(data['Place of Publication'].dtypes)

object
category

In [17]:
# cleaning entire dataset using applymap function

import requests

data = "https://raw.githubusercontent.com/realpython/python-data-cleaning/refs/heads/master/Datasets/university_towns.txt"

response = requests.get(data)
text_data = response.text

# Print first 20 lines
for line in text_data.splitlines()[:20]:
    print(line)

Alabama[edit]
Auburn (Auburn University)[1]
Florence (University of North Alabama)
Jacksonville (Jacksonville State University)[2]
Livingston (University of West Alabama)[2]
Montevallo (University of Montevallo)[2]
Troy (Troy University)[2]
Tuscaloosa (University of Alabama, Stillman College, Shelton State)[3][4]
Tuskegee (Tuskegee University)[5]
Alaska[edit]
Fairbanks (University of Alaska Fairbanks)[2]
Arizona[edit]
Flagstaff (Northern Arizona University)[6]
Tempe (Arizona State University)
Tucson (University of Arizona)
Arkansas[edit]
Arkadelphia (Henderson State University, Ouachita Baptist University)[2]
Conway (Central Baptist College, Hendrix College, University of Central Arkansas)[2]
Fayetteville (University of Arkansas)[7]
Jonesboro (Arkansas State University)[8]

In [18]:
# generating a dataframe from the txt file
# based on the txt file pattern, town name will have [edit]
# followed by university
unis_towns = []
for line in text_data.splitlines():
  if '[edit]' in line:
    state = line
  else:
    unis_towns.append((state,line))

unis_towns[:5]

[('Alabama[edit]', 'Auburn (Auburn University)[1]'),
 ('Alabama[edit]', 'Florence (University of North Alabama)'),
 ('Alabama[edit]', 'Jacksonville (Jacksonville State University)[2]'),
 ('Alabama[edit]', 'Livingston (University of West Alabama)[2]'),
 ('Alabama[edit]', 'Montevallo (University of Montevallo)[2]')]

In [19]:
# converting the data structure to a dataframe

unis_towns_df = pd.DataFrame(unis_towns, columns=['State', 'Region Name'])
unis_towns_df

               State                                        Region Name
0      Alabama[edit]                      Auburn (Auburn University)[1]
1      Alabama[edit]             Florence (University of North Alabama)
2      Alabama[edit]    Jacksonville (Jacksonville State University)[2]
3      Alabama[edit]         Livingston (University of West Alabama)[2]
4      Alabama[edit]           Montevallo (University of Montevallo)[2]
..               ...                                                ...
512  Wisconsin[edit]  River Falls (University of Wisconsin–River Fal...
513  Wisconsin[edit]  Stevens Point (University of Wisconsin–Stevens...
514  Wisconsin[edit]                      Waukesha (Carroll University)
515  Wisconsin[edit]  Whitewater (University of Wisconsin–Whitewater...
516    Wyoming[edit]                 Laramie (University of Wyoming)[5]

[517 rows x 2 columns]

In [20]:
unis_towns_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 517 entries, 0 to 516
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   State        517 non-null    object
 1   Region Name  517 non-null    object
dtypes: object(2)
memory usage: 8.2+ KB

In [21]:
def get_citystate(item):
  if ' (' in item:
    return item[:item.find(' (')]
  elif '[' in item:
    return item[:item.find('[')]
  else:
    return item

In [22]:
# clean the data from symbol
unis_towns_df =  unis_towns_df.applymap(get_citystate)
unis_towns_df.head(20)

       State   Region Name
0    Alabama        Auburn
1    Alabama      Florence
2    Alabama  Jacksonville
3    Alabama    Livingston
4    Alabama    Montevallo
5    Alabama          Troy
6    Alabama    Tuscaloosa
7    Alabama      Tuskegee
8     Alaska     Fairbanks
9    Arizona     Flagstaff
10   Arizona         Tempe
11   Arizona        Tucson
12  Arkansas   Arkadelphia
13  Arkansas        Conway
14  Arkansas  Fayetteville
15  Arkansas     Jonesboro
16  Arkansas      Magnolia
17  Arkansas    Monticello
18  Arkansas  Russellville
19  Arkansas        Searcy

In [23]:
# Renaming columns and Skipping rows
data = 'https://raw.githubusercontent.com/realpython/python-data-cleaning/refs/heads/master/Datasets/olympics.csv'
olympics_data = pd.read_csv(data)
olympics_data.head()

# skip first row to change header
# column 0 - country
# column 1,6,11 - type of games
# column 2,3,4 etc - gold siler bronze medal

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,? Summer,01 !,02 !,03 !,Total,? Winter,01 !,02 !,03 !,Total,? Games,01 !,02 !,03 !,Combined total
1,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12

In [25]:
# Changing the header by skipping the first row.

olympics_data = pd.read_csv(data, header=1)
olympics_data.head()

,Unnamed: 0,? Summer,01 !,02 !,03 !,Total,? Winter,01 !.1,02 !.1,03 !.1,Total.1,? Games,01 !.2,02 !.2,03 !.2,Combined total
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [26]:
# rename column using rename() function
columnames = {'Unnamed: 0': 'Country',
              '? Summer': 'Summer Olympics',
              '01 !': 'Gold',
              '02 !': 'Silver',
              '03 !': 'Bronze',
              '? Winter': 'Winter Olympics',
              '01 !.1': 'Gold.1',
              '02 !.1': 'Silver.1',
              '03 !.1': 'Bronze.1',
              '? Games': '# Games',
              '01 !.2': '# Gold.2',
              '02 !.2': '# Silver.2',
              '03 !.2': '# Bronze.2'}

olympics_data = olympics_data.rename(columns=columnames)
olympics_data.head()

,Country,Summer Olympics,Gold,Silver,Bronze,Total,Winter Olympics,Gold.1,Silver.1,Bronze.1,Total.1,# Games,# Gold.2,# Silver.2,# Bronze.2,Combined total
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [27]:
olympics_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 147 entries, 0 to 146
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country          147 non-null    object
 1   Summer Olympics  147 non-null    int64
 2   Gold             147 non-null    int64
 3   Silver           147 non-null    int64
 4   Bronze           147 non-null    int64
 5   Total            147 non-null    int64
 6   Winter Olympics  147 non-null    int64
 7   Gold.1           147 non-null    int64
 8   Silver.1         147 non-null    int64
 9   Bronze.1         147 non-null    int64
 10  Total.1          147 non-null    int64
 11  # Games          147 non-null    int64
 12  # Gold.2         147 non-null    int64
 13  # Silver.2       147 non-null    int64
 14  # Bronze.2       147 non-null    int64
 15  Combined total   147 non-null    int64
dtypes: int64(15), object(1)
memory usage: 18.5+ KB

In [28]:
# changing/cleaning country name
def get_country(item):
  if '[' in item:
    return item[:item.find('[')]
  else:
    return item

# clean the data from symbol
olympics_data['Country'] =  olympics_data['Country'].apply(get_country)
olympics_data.head(20)

,Country,Summer Olympics,Gold,Silver,Bronze,Total,Winter Olympics,Gold.1,Silver.1,Bronze.1,Total.1,# Games,# Gold.2,# Silver.2,# Bronze.2,Combined total
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia (ANZ),2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
5,Australia (AUS),25,139,152,177,468,18,5,3,4,12,43,144,155,181,480
6,Austria (AUT),26,18,33,35,86,22,59,78,81,218,48,77,111,116,304
7,Azerbaijan (AZE),5,6,5,15,26,5,0,0,0,0,10,6,5,15,26
8,Bahamas (BAH),15,5,2,5,12,0,0,0,0,0,15,5,2,5,12
9,Bahrain (BRN),8,0,0,1,1,0,0,0,0,0,8,0,0,1,1
10,Barbados (BAR),11,0,0,1,1,0,0,0,0,0,11,0,0,1,1
11,Belarus (BLR),5,12,24,39,75,6,6,4,5,15,11,18,28,44,90
12,Belgium (BEL),25,37,52,53,142,20,1,1,3,5,45,38,53,56,147
13,Bermuda (BER),17,0,0,1,1,7,0,0,0,0,24,0,0,1,1
14,Bohemia (BOH),3,0,1,3,4,0,0,0,0,0,3,0,1,3,4
15,Botswana (BOT),9,0,1,0,1,0,0,0,0,0,9,0,1,0,1
16,Brazil (BRA),21,23,30,55,108,7,0,0,0,0,28,23,30,55,108
17,British West Indies (BWI),1,0,0,2,2,0,0,0,0,0,1,0,0,2,2
18,Bulgaria (BUL),19,51,85,78,214,19,1,2,3,6,38,52,87,81,220
19,Burundi (BDI),5,1,0,0,1,0,0,0,0,0,5,1,0,0,1